# Manejo de datos Nulos

In [48]:
import pandas as pd
import numpy as np

In [49]:
datos = {
    'Col1':[1,2,3,4,np.nan],
    'Col2':[4,4,np.nan,np.nan,5],
    'Col3':['a','b','c',np.nan,'z'],
    'Col4':[1,2,3,4,None]
    }

In [50]:
df= pd.DataFrame(datos)

In [51]:
df

   Col1  Col2 Col3  Col4
0   1.0   4.0    a   1.0
1   2.0   4.0    b   2.0
2   3.0   NaN    c   3.0
3   4.0   NaN  NaN   4.0
4   NaN   5.0    z   NaN

¿Hay valores nulos?

In [52]:
df.isnull()

    Col1   Col2   Col3   Col4
0  False  False  False  False
1  False  False  False  False
2  False   True  False  False
3  False   True   True  False
4   True  False  False   True

In [53]:
# Los unos se indican los números nulos en el dataframe
df.isnull()*1

   Col1  Col2  Col3  Col4
0     0     0     0     0
1     0     0     0     0
2     0     1     0     0
3     0     1     1     0
4     1     0     0     1

In [55]:
# Los nulos son cambiados a `missing`
df.fillna('missing')

      Col1     Col2     Col3     Col4
0      1.0      4.0        a      1.0
1      2.0      4.0        b      2.0
2      3.0  missing        c      3.0
3      4.0  missing  missing      4.0
4  missing      5.0        z  missing

In [56]:
df.isnull()

    Col1   Col2   Col3   Col4
0  False  False  False  False
1  False  False  False  False
2  False   True  False  False
3  False   True   True  False
4   True  False  False   True

In [38]:
df['Col2']

0    4.0
1    4.0
2    NaN
3    NaN
4    5.0
Name: Col2, dtype: float64

In [39]:
df.describe()

           Col1      Col2      Col4
count  4.000000  3.000000  4.000000
mean   2.500000  4.333333  2.500000
std    1.290994  0.577350  1.290994
min    1.000000  4.000000  1.000000
25%    1.750000  4.000000  1.750000
50%    2.500000  4.000000  2.500000
75%    3.250000  4.500000  3.250000
max    4.000000  5.000000  4.000000

In [66]:
# cambia nulos de Col1 por la media de esa columna
df['Col1'].fillna(df['Col1'].mean(),inplace=True)
df

   Col1      Col2 Col3  Col4
0   1.0  4.000000    a   1.0
1   2.0  4.000000    b   2.0
2   3.0  4.333333    c   3.0
3   4.0  4.333333    z   4.0
4   2.5  5.000000    z   NaN

In [65]:
df['Col2'].fillna(df['Col2'].mean(),inplace=True)
df

   Col1      Col2 Col3  Col4
0   1.0  4.000000    a   1.0
1   2.0  4.000000    b   2.0
2   3.0  4.333333    c   3.0
3   4.0  4.333333    z   4.0
4   2.5  5.000000    z   NaN

In [67]:
# cambia nulos de Col3 por la moda de esa columna
df['Col3'].fillna(df['Col3'].mode(), inplace=True)
df

   Col1      Col2 Col3  Col4
0   1.0  4.000000    a   1.0
1   2.0  4.000000    b   2.0
2   3.0  4.333333    c   3.0
3   4.0  4.333333    z   4.0
4   2.5  5.000000    z   NaN

In [59]:
df['Col4'].describe()

count    4.000000
mean     2.500000
std      1.290994
min      1.000000
25%      1.750000
50%      2.500000
75%      3.250000
max      4.000000
Name: Col4, dtype: float64

In [60]:
df['Col4'].quantile(.75)

3.25

In [69]:
# Cambia nulos de Col4 por el 3er quartil de esa columna
df['Col4'].fillna(df['Col4'].quantile(0.75),inplace=True)

Todos los nulos fueron solucionados con diferentes estrategias

In [71]:
df

   Col1      Col2 Col3  Col4
0   1.0  4.000000    a  1.00
1   2.0  4.000000    b  2.00
2   3.0  4.333333    c  3.00
3   4.0  4.333333    z  4.00
4   2.5  5.000000    z  3.25

también existe la opción `interpolate()`